TITLE ЛР_1;I.ЗАГОЛОВОК ПРОГРАМИ
;------------------------------------------------------------------------------
;ЛР  №1.1
;------------------------------------------------------------------------------
; Архітектура комп'ютера
; Завдання:     Основи розробки і налагодження
; ВУЗ:          КНУУ "КПІ"
; Факультет:    ФІОТ
; Курс:         1
; Група:        ІТ-01
;------------------------------------------------------------------------------
; Автор:        команда 8(Степаненко, Салимоненко, Дурдинець)
; Дата:         10/02/2021
;---------------------------------
				
IDEAL;Директива - тип Асемблера tasm
MODEL small;Директива - тип моделі пам’яті 
STACK 256;Директива - розмір стеку
				
DATASEG;III.ПОЧАТОК СЕГМЕНТУ ДАНИХ
exCode db 0;Код завершення програми
stepanenko db "Stepanenko Anatolii",10,13,'$';Рядок символів для виводу на екран
salymonenko db "Salymonenko Vadym",10,13,'$';Рядок символів для виводу на екран
durdynets db "Durdynets Aleksandr",10,13,'$';Рядок символів для виводу на екран

				
CODESEG
Start:
;--------------------------------- 1. Ініціалізація DS и ES---------------------------------------
	mov ax,@data; @data ідентифікатор, що створюються директивою model
	mov ds, ax	; Завантаження початку сегменту даних в регістр ds
	mov es, ax	; Завантаження початку сегменту даних в регістр es

;----------------------------------2. Операція виводу на консоль---------------------------------
	mov dx, offset stepanenko;Пересилання адреси рядка символів message в регістр dx
	mov ah,09h;Завантаження числа 09h до регістру ah
	int 21h;Переривання
	
	mov dx, offset salymonenko
	mov ah, 09h
	int 21h

	mov dx, offset durdynets
	mov ah, 09h
	int 21h

;----------------------------------3. Операція зупинки програми, очікування натискання клавіш-----
	mov ah,01h; Завантаження числа 01h до регістру ah
	int 21h		; Виклик функції DOS 1h(Функція DOS 1h - команда очікування натискання клавіші...)

;---------------------------------4. Вихід з програми---------------------------------------------
	mov ah,4ch; Завантаження числа 4ch до регістру ah
	mov al,[exCode]	; отримання коду виходу 
	int 21h		
	end Start
  
DOS 4ch; виклик функції DOS 4ch(Функція DOS 4ch - виходу з програми)
	end Start