;----------------I.ЗАГОЛОВОК ПРОГРАМИ------------------------
IDEAL
MODEL SMALL
STACK 512
;--------------------II.ПОЧАТОК СЕГМЕНТУ ДАНИХ--------------
DATASEG
;Оголошення двовимірного експериментального масиву 16х16
array2Db db 0, 8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 41h ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,59h ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,4fh ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0, 0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,54h ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,56h ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,4fh ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8
exCode DB 0
CODESEG
;----------------------III. ПОЧАТОК СЕГМЕНТУ КОДУ-------------------
Start:
mov ax, @data ; ax <- @data
mov ds, ax ; ds <- ax

Exit:
mov ah,04Ch
mov al,[exCode] ; отримання коду виходу
int 21h ; виклик функції DOS 4ch
END Start